dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  (semaPt->value) = value;

  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Signal signals a given semaphore.
//
//***********************************************************************

void 
OS_Signal(Sema4Type *semaPt)
{
  TCB * temp = ThreadList;  // pointer to all threads in the threadlist
  TCB * toUnblock = NULL;          // pointer to thread to unblock
  unsigned long highest_priority = 100; 
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  (semaPt->value)++;
  if((semaPt->value) <= 0)
  {
     do
     {
       if(((temp->BlockPt) == semaPt) && (temp->priority < highest_priority)) 
       {
         toUnblock = temp;   // If a thread is blocked by this semaphore and 
                             // is the highest priority, unblock the thread
         highest_priority = toUnblock->priority;
       }
       temp = temp->next;
     }
     while(temp != ThreadList);
     if(toUnblock->BlockPt != NULL && toUnblock != NULL)
     {
       toUnblock->BlockPt = NULL;
     }
  }
  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Wait waits for a given semaphore.
//
//***********************************************************************

void 
OS_Wait(Sema4Type *semaPt)
{
  long sr;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  (semaPt->value)--;
  if((semaPt->value) < 0)
  {
     CurrentThread->BlockPt = semaPt;
     OS_Suspend();
  }
  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_bSignal signals binary semaphore. 
//
//***********************************************************************

void 
OS_bSignal(Sema4Type *semaPt)
{
  (semaPt->value) = 1;
}

//***********************************************************************
//
//   OS_bSignal waits for binary semaphore.
//
//***********************************************************************

void 
OS_bWait(Sema4Type *semaPt)
{
  IntMasterDisable();
  while((semaPt->value) == 0)
  {
  	IntMasterEnable();

  	IntMasterDisable();
  }
  (semaPt->value) = 0;
  IntMasterEnable();
}

//***********************************************************************
//
// PerThreadSwitchInit initializes the SysTick timer to interrupt at the 
// specified period to perform thread switching
//
// \param period is the period at which threads will be swtiched
// 
// \return SUCCESS if function was successful and FAIL if period 
// paramter is out of range.
//
//***********************************************************************
int 
PerThreadSwitchInit(unsigned long period)
{
  // Enable SysTick Interrupts
  SysTickIntEnable();

  // Set the period in ms
  SysTickPeriodSet(period);

  // Set Systick priority to high, PendSV priority to low
  IntPrioritySet(FAULT_SYSTICK,(((unsigned char)1)<<5)&0xF0);
  IntPrioritySet(FAULT_PENDSV,(((unsigned char)7)<<5)&0xF0);
  
  // Enable the SysTick module  
  SysTickEnable();

  return SUCCESS;
}

//***********************************************************************
//
// Timer 3A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
long timeCheck;
void
Timer3AIntHandler(void)
{
  static unsigned long LastTime;  // time at previous interrupt  
  static unsigned long thisTime;         // time at current interrupt
  long jitter;                    // time between measured and expected
  int index;

  // Jitter calculation:
  thisTime = OS_Time();       // current time, 20 ns
  timeCheck = OS_TimeDifference(thisTime, LastTime);
  jitter = ((OS_TimeDifference(thisTime, LastTime)-PeriodTimerA)*CLOCK_PERIOD)/1000;  // in usec
  if(jitter > MaxJitterB){
    MaxJitterB = jitter;
  }
  if(jitter < MinJitterB){
    MinJitterB = jitter;
  }        // jitter should be 0
  index = jitter+JITTERSIZE/2;   // us units
  if(index<0)index = 0;
  if(index>=JitterSize)index = JITTERSIZE-1;
  JitterHistogramA[index]++; 
  LastTime = thisTime;

  // Execute the periodic thread
  TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
  PeriodicTaskA();  
}

//***********************************************************************
//
// Timer 3B Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer3BIntHandler(void)
{
  static unsigned long LastTime;  // time at previous interrupt  
  unsigned long thisTime;         // time at current interrupt
  long jitter;                    // time between measured and expected
  int index;

  // Jitter calculation:
  thisTime = OS_Time();       // current time, 20 ns
  jitter = ((OS_TimeDifference(thisTime,LastTime)-PeriodTimerB)*CLOCK_PERIOD)/1000;  // in usec
  if(jitter > MaxJitterB){
    MaxJitterB = jitter;
  }
  if(jitter < MinJitterB){
    MinJitterB = jitter;
  }        // jitter should be 0
  index = jitter+JITTERSIZE/2;   // us units
  if(index<0)index = 0;
  if(index>=JitterSize)index = JITTERSIZE-1;
  JitterHistogramB[index]++; 
  LastTime = thisTime;
  
  // Execute Periodic task
  TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
  PeriodicTaskB();  
}

//***********************************************************************
//
// Timer 2A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer2IntHandler(void)
{
//  IntMasterDisable();
  
  //If the button is still pressed, execute the user task.
  if(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1))
  {
    ButtonTask();
  }
  //Wait for the user to release the button
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
  
  //Debounce for 10ms
  //SysCtlDelay((SysCtlClockGet()/1000)*10);

