dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  //Re-read switch to make sure it is unpressed.
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));

  //Clear the interrupt
  GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  
  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);

//  IntMasterEnable();  
}

//***********************************************************************
//
// SysTick handler, enables PendSV for thread switching.
//
//***********************************************************************

void
SysTickThSwIntHandler(void)
{   
  TriggerPendSV();
}

//***********************************************************************
//
// PendSV handler, switches threads.  Disables interrupts during execution.
//
//***********************************************************************
void 
PendSVHandler(void)
{
  TCB * TempPt;
  static unsigned long RunPriorityLevel;
  long sr;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  
  //Determine the priority level to run	and update sleeping threads
  RunPriorityLevel = 100;     //Initialize to rediculously low priority
  TempPt = ThreadList;
  do
  {
    // Find lowest active priority level
    if((TempPt->BlockPt == NULL)&&(TempPt->priority < RunPriorityLevel)&&(TempPt->sleepCount == 0))
	{
        RunPriorityLevel = TempPt->priority;
	}
	  // Decrement sleep counter on sleeping threads
    if(TempPt->sleepCount > 0)
	{
      (TempPt->sleepCount)--;
	}
	TempPt = TempPt->next;
  }while(TempPt != ThreadList);


  // Find the next thread that is not...
  // (1) Sleeping
  // (2) Blocked or
  // (3) Too low in priority
  NextThread = CurrentThread->next;
  while((NextThread->sleepCount != 0)||(NextThread->BlockPt != NULL)||(NextThread->priority > RunPriorityLevel))
  {
    NextThread = NextThread->next;
  }
  
  HWREG(NVIC_ST_CURRENT) = 0;
  OS_EXITCRITICAL();
 
  SwitchThreads();  
}

//***********************************************************************
//
// Select switch interrupt handler.  Executes task set by OS_AddButtonTask.
//
//***********************************************************************
void
SelectSwitchIntHandler(void)
{
  //
  // Enable Timer2 module
  //
  SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

  //
  // Configure Timer2 as a 32-bit one-shot timer.
  //
  TimerConfigure(TIMER2_BASE, TIMER_CFG_32_BIT_OS);

  //
  // Set the Timer2 load value to generate the period specified by the user.
  //
  // 1000 at 50Mhz = 20us
  TimerLoadSet(TIMER2_BASE, TIMER_BOTH, 100000);

  //
  // Enable the Timer2 interrupt.
  //
  TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  IntEnable(INT_TIMER2A);                                                                                
  //
  // Start Timer2.
  //
  TimerEnable(TIMER2_BASE, TIMER_BOTH);
  GPIOPinIntDisable(GPIO_PORTF_BASE, GPIO_PIN_1);
}
 
//******************************EOF**************************************




